In [1]:
import os, pandas as pd
os.chdir(r'D:\새 폴더\Programing\Academy\Python\day0826')

In [2]:
os.listdir()

['analysis', 'data_analysis', 'today(day0826).txt']

In [3]:
# cvs 파일읽기
df=pd.read_csv('data_analysis/subway2507.csv',index_col=False)

In [ ]:
if df.columns[-1] == df.columns[-1].strip():  # 혹은 그냥 이름이 'Unnamed: 6'이면
    df = df.iloc[:, :-1]

# 숫자 컬럼이 문자열로 들어왔다면 숫자로 변환
df['승차총승객수'] = pd.to_numeric(df['승차총승객수'], errors='coerce')
df['하차총승객수'] = pd.to_numeric(df['하차총승객수'], errors='coerce')

In [10]:
df.head()

       사용일자  노선명        역명  승차총승객수  하차총승객수
0  20250701  경원선        창동       9       0
1  20250701  장항선  쌍용(나사렛대)    2260    2155
2  20250701  장항선        아산    3313    3113
3  20250701  장항선        탕정    1969    1778
4  20250701  장항선        배방    1260    1204

In [5]:
# 마지막 데이터 3개만 확인

# 언제 데이터부터 있었나 확인용 첫 번째 데이터의 날짜부분만

# 100 ~ 110번 데이터 노선번호, 역이름

# 노선번호로 찾을수 있게 세팅

df_by_line = df.set_index('노선명')
df.head()

# 2호선 데이터만

# 1호선 데이터의 역이름, 탄, 내린

# 탄 사람수가 50000이상인 데이터

# 탄 사람수가 50이 안되는 데이터의 날짜, 역이름

# '종각'역 데이터

# 역이름에 '입구'들어가는 데이터

# 역이름이 '서울'로 시작하는 데이터 노선

       사용일자  노선명        역명  승차총승객수  하차총승객수
0  20250701  경원선        창동       9       0
1  20250701  장항선  쌍용(나사렛대)    2260    2155
2  20250701  장항선        아산    3313    3113
3  20250701  장항선        탕정    1969    1778
4  20250701  장항선        배방    1260    1204

In [9]:
# 마지막 데이터 3개만 확인
df[-3:]

           사용일자  노선명  역명  승차총승객수  하차총승객수
19128  20250731  중앙선  양평    3186    3321
19129  20250731  중앙선  원덕     333     333
19130  20250731  중앙선  용문    2444    2413

In [ ]:
# 언제 데이터부터 있었나 확인용 첫 번째 데이터의 날짜부분만
df.loc[:0]

       사용일자  노선명  역명  승차총승객수  하차총승객수
0  20250701  경원선  창동       9       0